In [2]:
import pandas as pd
import numpy as np

In [5]:
sf =  {'p1': [34,68,36,72,60],
       'p2': [1.5, 1.7, 3.6, 2.4, 2.9],
       'AI': [20, 20, 22, 24, 72]}
sdf=pd.DataFrame(sf)
sdf

   AI  p1   p2
0  20  34  1.5
1  20  68  1.7
2  22  36  3.6
3  24  72  2.4
4  72  60  2.9

In [6]:
sdf['total'] = sdf.AI+sdf.p1+sdf.p2
sdf

   AI  p1   p2  total
0  20  34  1.5   55.5
1  20  68  1.7   89.7
2  22  36  3.6   61.6
3  24  72  2.4   98.4
4  72  60  2.9  134.9

In [7]:
sdf['per'] = (sdf.total/150)*100
sdf

   AI  p1   p2  total        per
0  20  34  1.5   55.5  37.000000
1  20  68  1.7   89.7  59.800000
2  22  36  3.6   61.6  41.066667
3  24  72  2.4   98.4  65.600000
4  72  60  2.9  134.9  89.933333

In [8]:
sdf['status'] = ['Pass' if i>=45 else 'Fail' for i in sdf.per]
sdf

   AI  p1   p2  total        per status
0  20  34  1.5   55.5  37.000000   Fail
1  20  68  1.7   89.7  59.800000   Pass
2  22  36  3.6   61.6  41.066667   Fail
3  24  72  2.4   98.4  65.600000   Pass
4  72  60  2.9  134.9  89.933333   Pass

In [10]:
sdf['status'] = ['Pass' np.where(data['p1']>7 and data['p2']>7 and data['AI']>7)]

SyntaxError: invalid syntax (<ipython-input-10-ca08416be6a0>, line 1)

Approach 1:  use if all to take all three columns at once
Approach 2:  use np.where
Approach 3:  use for i loop

In [11]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [13]:
pop=pd.DataFrame(pop)
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [14]:
pop.T              #    only changes for the display

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [15]:
pop                # otherwise the pop is still in the original form.

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
pdata = {'Ohio': pop['Ohio'][:0], 'Nevada': pop['Nevada'][:1]}
pdata =pd.DataFrame(pdata)
pdata                                         # the values in [:0] are the index for concerned lists but it starts with 1 to onwards

      Nevada  Ohio
2000     NaN   NaN

In [37]:
pdata = {'Ohio': pop['Ohio'][:1], 'Nevada': pop['Nevada'][:1]}
pdata =pd.DataFrame(pdata)
pdata                                         # the values in [:0] are the index for concerned lists but it starts with 1 to onwards

      Nevada  Ohio
2000     NaN   1.5

In [38]:
pdata = {'Ohio': pop['Ohio'][:2], 'Nevada': pop['Nevada'][:1]}
pdata =pd.DataFrame(pdata)
pdata                                         # the values in [:0] are the index for concerned lists but it starts with 1 to onwards

      Nevada  Ohio
2000     NaN   1.5
2001     NaN   1.7

In [39]:
pdata = {'Ohio': pop['Ohio'][:3], 'Nevada': pop['Nevada'][:1]}
pdata =pd.DataFrame(pdata)
pdata                                         # the values in [:0] are the index for concerned lists but it starts with 1 to onwards
            ######## BE CAREFUL, THIS IS ALL CHANGING THE PDATA ITSELF #############

      Nevada  Ohio
2000     NaN   1.5
2001     NaN   1.7
2002     NaN   3.6

In [41]:
pdata = {'Ohio': pop['Ohio'][:4], 'Nevada': pop['Nevada'][1:2]}
pdata =pd.DataFrame(pdata)
pdata                                         # the values in [:0] are the index for concerned lists but it starts with 1 to onwards
                                      # the [:4] here exceeds the range of index but it doesn't matter 'cause 'Ohio' doesn't have anything else to give.

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     NaN   3.6

In [43]:
'Ohio' in pdata.columns

True

In [44]:
2000 in pdata.index

True

In [46]:
pdata

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     NaN   3.6

In [47]:
#replace back the pdata
pdata = {'Ohio': pop['Ohio'][:], 'Nevada': pop['Nevada'][:]}
pdata =pd.DataFrame(pdata)
pdata

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [48]:
pdata.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [49]:
#   method='ffill'    fills the unidentified (empty) index. i.e, forwards the previous index location to the next Nan

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
data.drop(['two', 'four'], axis=1)            # .drop does not alter the original data matrix

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14